## staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                   NAME                                                                    |
|--------|-------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_ses_domain_mail_from.custom_sending_domains[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]`                            |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]`    |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]` |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]`  |
|        | `aws_sesv2_email_identity.custom_sending_domains[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz&quot;]`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ses_domain_mail_from.custom_sending_domains["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_ses_domain_mail_from" "custom_sending_domains" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + id                     = (known after apply)
      + mail_from_domain       = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_bounce_topic" {
      + id                       = (known after apply)
      + identity                 = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Bounce"
      + topic_arn                = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_complaint_topic" {
      + id                       = (known after apply)
      + identity                 = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Complaint"
      + topic_arn                = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_delivery_topic" {
      + id                       = (known after apply)
      + identity                 = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + include_original_headers = false
      + notification_type        = "Delivery"
      + topic_arn                = "arn:aws:sns:ca-central-1:239043911459:ses-callback"
    }

  # aws_sesv2_email_identity.custom_sending_domains["custom-sending-domain.staging.notification.cdssandbox.xyz"] will be created
  + resource "aws_sesv2_email_identity" "custom_sending_domains" {
      + arn                         = (known after apply)
      + email_identity              = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"custom-sending-domain.staging.notification.cdssandbox.xyz\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
